llm/benchmark_results/20251028_113904/structured_grammar/results_grammar.txt
INFO 10-28 04:46:27 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='https://dotieuthien--example-vllm-openai-compatible-serve.modal.run', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset='grammar', json_schema_path=None, max_concurrency=None, model='Qwen/Qwen2.5-VL-7B-Instruct-AWQ', tokenizer=None, tokenizer_mode='auto', num_prompts=100, output_len=128, request_rate=10.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, save_results=False, profile=False, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, no_structured_output=False, structured_output_ratio=1.0)
Input length of the prompt: 22 tokens
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  35.25     
Total input tokens:                      2200      
Total generated tokens:                  8447      
Request throughput (req/s):              2.84      
Output token throughput (tok/s):         239.63    
Total Token throughput (tok/s):          302.04    
---------------Time to First Token----------------
Mean TTFT (ms):                          9649.17   
Median TTFT (ms):                        9350.67   
P99 TTFT (ms):                           22541.55  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          39.89     
Median TPOT (ms):                        39.72     
P99 TPOT (ms):                           54.80     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.09     
Median ITL (ms):                         0.01      
P99 ITL (ms):                            393.59    
==================================================
correct_rate(%) None 



=== STDERR ===

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:02<04:23,  2.66s/it]
  3%|▎         | 3/100 [00:03<01:21,  1.19it/s]
  7%|▋         | 7/100 [00:03<00:30,  3.10it/s]
  9%|▉         | 9/100 [00:04<00:34,  2.63it/s]
 10%|█         | 10/100 [00:04<00:35,  2.52it/s]
 11%|█         | 11/100 [00:05<00:32,  2.77it/s]
 12%|█▏        | 12/100 [00:05<00:35,  2.50it/s]
 13%|█▎        | 13/100 [00:05<00:28,  3.07it/s]
 17%|█▋        | 17/100 [00:05<00:12,  6.62it/s]
 19%|█▉        | 19/100 [00:06<00:14,  5.63it/s]
 21%|██        | 21/100 [00:06<00:17,  4.55it/s]
 22%|██▏       | 22/100 [00:07<00:16,  4.62it/s]
 23%|██▎       | 23/100 [00:08<00:32,  2.40it/s]
 24%|██▍       | 24/100 [00:08<00:31,  2.39it/s]
 26%|██▌       | 26/100 [00:09<00:29,  2.54it/s]
 27%|██▋       | 27/100 [00:10<00:33,  2.16it/s]
 30%|███       | 30/100 [00:11<00:27,  2.50it/s]
 31%|███       | 31/100 [00:11<00:26,  2.58it/s]
 32%|███▏      | 32/100 [00:11<00:22,  2.96it/s]
 33%|███▎      | 33/100 [00:11<00:20,  3.23it/s]
 34%|███▍      | 34/100 [00:12<00:21,  3.12it/s]
 35%|███▌      | 35/100 [00:12<00:19,  3.30it/s]
 36%|███▌      | 36/100 [00:12<00:21,  2.99it/s]
 37%|███▋      | 37/100 [00:13<00:22,  2.79it/s]
 38%|███▊      | 38/100 [00:13<00:18,  3.28it/s]
 39%|███▉      | 39/100 [00:13<00:21,  2.87it/s]
 40%|████      | 40/100 [00:14<00:19,  3.11it/s]
 41%|████      | 41/100 [00:14<00:16,  3.62it/s]
 42%|████▏     | 42/100 [00:14<00:14,  4.09it/s]
 43%|████▎     | 43/100 [00:15<00:25,  2.24it/s]
 44%|████▍     | 44/100 [00:16<00:28,  1.95it/s]
 45%|████▌     | 45/100 [00:16<00:25,  2.12it/s]
 46%|████▌     | 46/100 [00:17<00:29,  1.86it/s]
 47%|████▋     | 47/100 [00:17<00:28,  1.86it/s]
 48%|████▊     | 48/100 [00:18<00:28,  1.84it/s]
 49%|████▉     | 49/100 [00:18<00:27,  1.82it/s]
 51%|█████     | 51/100 [00:19<00:18,  2.67it/s]
 52%|█████▏    | 52/100 [00:19<00:17,  2.67it/s]
 53%|█████▎    | 53/100 [00:20<00:22,  2.06it/s]
 55%|█████▌    | 55/100 [00:20<00:14,  3.13it/s]
 57%|█████▋    | 57/100 [00:20<00:10,  4.21it/s]
 58%|█████▊    | 58/100 [00:21<00:09,  4.22it/s]
 59%|█████▉    | 59/100 [00:21<00:13,  2.98it/s]
 60%|██████    | 60/100 [00:22<00:22,  1.77it/s]
 61%|██████    | 61/100 [00:23<00:19,  2.00it/s]
 62%|██████▏   | 62/100 [00:23<00:17,  2.23it/s]
 64%|██████▍   | 64/100 [00:23<00:11,  3.17it/s]
 65%|██████▌   | 65/100 [00:24<00:11,  3.13it/s]
 67%|██████▋   | 67/100 [00:24<00:07,  4.65it/s]
 68%|██████▊   | 68/100 [00:24<00:07,  4.36it/s]
 71%|███████   | 71/100 [00:24<00:03,  7.49it/s]
 73%|███████▎  | 73/100 [00:25<00:07,  3.70it/s]
 74%|███████▍  | 74/100 [00:26<00:06,  3.74it/s]
 75%|███████▌  | 75/100 [00:26<00:06,  3.74it/s]
 76%|███████▌  | 76/100 [00:27<00:12,  1.87it/s]
 77%|███████▋  | 77/100 [00:27<00:10,  2.25it/s]
 79%|███████▉  | 79/100 [00:28<00:06,  3.22it/s]
 80%|████████  | 80/100 [00:28<00:05,  3.48it/s]
 81%|████████  | 81/100 [00:29<00:07,  2.63it/s]
 82%|████████▏ | 82/100 [00:29<00:06,  2.73it/s]
 83%|████████▎ | 83/100 [00:29<00:05,  3.18it/s]
 85%|████████▌ | 85/100 [00:30<00:04,  3.36it/s]
 86%|████████▌ | 86/100 [00:30<00:03,  3.71it/s]
 87%|████████▋ | 87/100 [00:30<00:04,  3.03it/s]
 88%|████████▊ | 88/100 [00:31<00:03,  3.05it/s]
 89%|████████▉ | 89/100 [00:31<00:05,  2.19it/s]
 91%|█████████ | 91/100 [00:32<00:02,  3.57it/s]
 93%|█████████▎| 93/100 [00:32<00:02,  3.02it/s]
 94%|█████████▍| 94/100 [00:33<00:01,  3.25it/s]
 95%|█████████▌| 95/100 [00:33<00:01,  3.46it/s]
 97%|█████████▋| 97/100 [00:33<00:00,  3.89it/s]
 98%|█████████▊| 98/100 [00:34<00:00,  3.33it/s]
 99%|█████████▉| 99/100 [00:34<00:00,  2.81it/s]
100%|██████████| 100/100 [00:35<00:00,  2.51it/s]
100%|██████████| 100/100 [00:35<00:00,  2.84it/s]